class Question {
  String qstn, op1, op2, op3;
  int ans;
  List option = List(4);

  Question(this.qstn, this.ans,  this.option[1], this.option[2],this.option[3],this.option[4]);
}

var test1 = [
  Question(
    "സ്‌കൂള്‍ ബസുകള്‍ കുട്ടികളെ കയറ്റുന്നതിനോ ഇറക്കുന്നതിനോ നിര്‍ത്തിയിരിക്കുമ്പോള്‍",
    2,
    "ഹോണ്‍ മുഴക്കി വരുന്ന വേഗതയില്‍ പോകുക കുട്ടികള്‍ ആ ഭാഗത്ത് ഇറങ്ങി ഓടാന്‍ സാധ്യതയുണ്ടെന്ന്",
    "മനസിലാക്കി വളരെ കരുതലോടെ വേഗത കുറച്ച്‌ പോകുക.",
    "പ്രത്യേക ശ്രദ്ധ ആവശ്യമില്ല",
  ),
  Question("ലോറിയില്‍ ചരക്കുകള്‍ കയറ്റുമ്പോള്‍, ഇരുവശത്തേക്കും", 1, [
    "option",
    "",
  ]),
];
