import '../questionClass.dart';

var malayalam = [
  Question(
      "സ്‌കൂള്‍ ബസുകള്‍ കുട്ടികളെ കയറ്റുന്നതിനോ ഇറക്കുന്നതിനോ നിര്‍ത്തിയിരിക്കുമ്പോള്‍",
      2,
      [
        "ഹോണ്‍ മുഴക്കി വരുന്ന വേഗതയില്‍ പോകുക കുട്ടികള്‍ ആ ഭാഗത്ത് ഇറങ്ങി ഓടാന്‍ സാധ്യതയുണ്ടെന്ന്",
        "മനസിലാക്കി വളരെ കരുതലോടെ വേഗത കുറച്ച്‌ പോകുക.",
        "പ്രത്യേക ശ്രദ്ധ ആവശ്യമില്ല",
      ],
      null),
  Question(
      "ലോറിയില്‍ ചരക്കുകള്‍ കയറ്റുമ്പോള്‍, ഇരുവശത്തേക്കും",
      0,
      [
        "30 സെ. മീ. വരെ തള്ളിനില്‍ക്കാം",
        "തള്ളിനില്‍ക്കാന്‍ പാടില്ല",
        "50 സെ. മീ. വരെ തള്ളിനില്‍ക്കാം"
      ],
      null),
  Question(
      "പുതുതായി വാങ്ങിയ ഒര്‍ കാറിന്റെ ഒറ്റത്തവണ നികുതി",
      2,
      [
        "അഞ്ചു വര്‍ഷത്തേക്ക് ആണ്",
        "15 വര്‍ഷത്തേക്ക് ആണ്",
        "വാഹനത്തിന്റെ രജിസ്ട്രേഷന്‍ കാലാവധി തീരുന്നതു വരെ"
      ],
      null),
  Question("താഴെ പറയുന്ന സ്ഥലത്ത് പാര്‍ക്കിംഗ് നിരോധിച്ചിരിക്കുന്നു.", 1,
      ["ആശുപത്രിയുടെ പ്രവേശന കവാടം", "റോഡിന്റെ ഇടതു വശം", "കമ്പോളം"], null),
  Question(
      "ഒരു സ്യകാര്യ മോട്ടോര്‍ കാറിന് വിദ്യാഭ്യാസ സ്ഥാപനത്തിന് അരികെ ഉപയോഗിക്കാവുന്ന പരമാവധി വേഗത",
      0,
      ["40 കി.മീ", "25 കി.മീ", "30 കി.മീ"],
      null),
  Question("നിരോധിച്ചിട്ടില്ലാത്ത ഹോണ്‍", 3,
      ["എയര്‍ ഹോണ്‍", "മള്‍ട്ടി ടോണ്‍ ഹോണ്‍", "ഇലക്‌ട്രിക് ഹോണ്‍"], null),
  Question("നഗരാതിര്‍ത്തിക്കുള്ളില്‍ ഹെവി മോട്ടോര്‍ വാഹനങ്ങളുടെ പരമാവധി വേഗത",
      0, ["40 കി.മീ", "45 കി.മീ", "60 കി.മീ"], null),
  Question(
      "നമ്മുടെ വാഹനത്തെ മറ്റൊരു വാഹനം ഓവര്‍ടേക്ക് ചെയ്യുമ്പോള്‍",
      1,
      [
        "നമ്മുടെ വാഹനത്തിന്റെ വേഗത വര്‍ദ്ധിപ്പിക്കരുത്",
        "വേഗത വര്‍ദ്ധിപ്പിക്കാം",
        "ശ്രദ്ധയോടെ വേഗത വര്‍ദ്ധിപ്പിക്കാം"
      ],
      null),
  Question(
      "മോട്ടോര്‍ വാഹന നിയമം 112-)0 വകുപ്പ് അനുസരിച്ച്",
      0,
      [
        "വേഗത പരിധി ലംഘിക്കുവാന്‍ പാടില്ല",
        "ഡ്രൈവര്‍ മദ്യപിച്ച് വാഹനമോടിക്കരുത്",
        "ടാക്സ് അടക്കാതെ വാഹനം ഓടിക്കരുത്"
      ],
      null),
];
